           05  C-Name                PIC x(100).
           05  C-Language-Code       pic x(2).
           05  C-Email-Address       pic x(40).
           05  C-DNC                 pic x.
