           05  F2-Email-Address       pic x(40).
           05  F2-Name.
               10  F2-Last-Name       pic x(30).
               10  F2-First-Name      pic x(30).
               10  F2-Middle-Name     pic x(30).
               10  F2-Suffix          pic x(20).
           05  F2-DNC                 pic x(2).
           05  F2-Language-Code       pic x(2).
