           05  F3-Name.
               10  F3-Last-Name       pic x(40).
               10  F3-First-Name      pic x(40).
               10  F3-Middle-Name     pic x(40).
           05  F3-Email-Address       pic x(30).
           05  F3-Language-Code       pic x.
