//MATEGDD JOB MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//*  COBOL DB2 RUN JCL
//*
//STEP01   EXEC PGM=IKJEFT01,
//             DYNAMNBR=20,REGION=4096K
//STEPLIB  DD  DISP=SHR,DSN=DBC1.SDSNEXIT
//         DD  DISP=SHR,DSN=DB2.V12R1M0.SDSNLOAD
//SYSPRINT DD  SYSOUT=*
//SYSTSPRT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SYSTSIN  DD  *
DSN SYSTEM (DBC1   )
  RUN PROGRAM   (UPDATE) -
      PLAN      (MATEGDA ) -
      LIBRARY   ('MATEGD.COBOL.LOAD')
END
/*
