//MATEGDD JOB (529),'ASSEMBLE MAP',CLASS=A,MSGCLASS=A,
//             MSGLEVEL=(1,1),NOTIFY=&SYSUID
//PLIB    JCLLIB ORDER=(MATE1.PROCLIB)
//*
//* TO ASSEMBLE CICS BMS MAP
//*
//CICSMAP  EXEC DFHMAPS,
//         COPYLIB=MATEGD.CAP.COPY,       <= SYMBOLIC MAP COPY LIBRARY
//         SRCLIB=MATEGD.CAP.MAPLIB,      <= SOURCE LIBRARY
//         MEMBER=CAPUMSD  <= MAP MEMBER NAME
//*
